[
  {
    "title": "Password Cracking",
    "content": "Password cracking involves attackers trying to gain unauthorized access to systems, accounts, or files by deciphering passwords. It\\u2019s essential to understand hashing algorithms and why passwords are hashed for password cracking.",
    "link": "https://pclub.in/events/2024/04/10/password-cracking/"
  },
  {
    "title": "Linux Demystified: Strap-On! (Part 2)",
    "content": "Linux Demystified is a blog series by Programming Club IIT Kanpur, covering all the major components of a Linux distribution. This series is not an introduction on how to install/use Linux, nor a comparison between various Linux distributions, rather an explainer on what makes Linux so customizable and powerful. At the end of this series one would be able to customize their own OS, appreciate the differences and pick from the options available at every small level of an Operating System. Although, a complete beginner would easily be able to go through all the blogs in this series, an amateur Linux user may better appreciate and relate to them.",
    "link": "https://pclub.in/events/2024/03/24/linuxdemystified-Part-2/"
  },
  {
    "title": "Codecraft at PClub",
    "content": "CodeCraft is a month long event, where you can channel your inner developer and work on the below ideas to create something cool!",
    "link": "https://pclub.in/events/2024/03/07/codecraft/"
  },
  {
    "title": "Quantum Computing - Clutching the Game of Computational Power",
    "content": "Throw 2.1 billion transistors in the air, and about 2 years later, 4.2 billion will fall back down, it would take another 2 years to find where they all landed.",
    "link": "https://pclub.in/events/2023/08/23/quantumcomputing/"
  },
  {
    "title": "Domain Name System",
    "content": "Have you ever wondered what happens when you type in a website on a web browser? And you must have observed that most websites end with .com, .in, .gov, .org, etc. What do these signify? To answer these questions, we need to understand the Domain Name System (or DNS). Let\\u2019s start with understanding how domain names are built.",
    "link": "https://pclub.in/events/2022/12/08/domain-name-system/"
  },
  {
    "title": "Linux Demystified",
    "content": "Linux Demystified is a blog series by Programming Club IIT Kanpur, covering all the major components of a Linux distribution. This series is not an introduction on how to install/use Linux, nor a comparison between various Linux distributions, rather an explainer on what makes Linux so customizable and powerful. At the end of this series one would be able to customize their own OS, appreciate the differences and pick from the options available at every small level of an Operating System.",
    "link": "https://pclub.in/events/2021/12/25/Linux-Demystified-Origin-of-Linux-Part-1/"
  }
]
